import { WelcomeData } from '@/types/types';

export const welcomeData: WelcomeData = {
  title: 'به سامانه ارزیابی روانشناسی فرزند خود خوش آمدید',
  subtitle: 'سلامتی روان اولین گام به سوی زندگی شاد و سازنده است',
  description: 'این پرسشنامه به شما کمک می‌کند تا درک بهتری از وضعیت روانی فرزند خود داشته باشید. لطفاً با دقت به سوالات پاسخ دهید. تمام اطلاعات شما محرمانه باقی خواهد ماند.',
  instructions: [
    'پرسشنامه شامل ۴ دسته سوال است',
    'در هر بخش مشکلات مرتبط را انتخاب کنید',
    'صادقانه پاسخ دهید تا ارزیابی دقیق‌تری داشته باشید',
    'می‌توانید با دکمه‌های قبلی و بعدی بین صفحات حرکت کنید',
    'در پایان پاسخ‌های خود را مرور کرده و ثبت کنید'
  ]
};